**Currently on Problem 6**

Problems can be found here 
https://www.w3resource.com/python-exercises/pandas/string/index.php


Resources:
https://www.w3schools.com/python/python_ref_string.asp

https://docs.python.org/2.5/lib/string-methods.html

In [2]:
#importing modules
import pandas as pd
import numpy as np

<div class="alert alert-block alert-danger">
<b>Problem 1) Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values

In [2]:
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])

In [3]:
s.str.upper()

0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

In [4]:
s.str.lower()

0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object

Thoughts: Can't figure out the last question, finding the length of the string values

**Sample Solution 1)**

In [5]:
s.str.len()

0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

Thoughts: So to find the length of the strings in each index of a pd.Series, can use  pd.Series.str.len()

<div class="alert alert-block alert-info">
<b>Problem 2) Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series.

In [6]:
color1 = pd.Index([' Green', 'Black ', ' Red ', 'White', ' Pink '])

In [7]:
color1.str.isspace()

array([False, False, False, False, False])

In [8]:
#removing all whitespace
color1.str.strip()

Index(['Green', 'Black', 'Red', 'White', 'Pink'], dtype='object')

In [9]:
#removing left only white space
color1.str.lstrip()

Index(['Green', 'Black ', 'Red ', 'White', 'Pink '], dtype='object')

In [10]:
#removing right only white space
color1.str.rstrip()

Index([' Green', 'Black', ' Red', 'White', ' Pink'], dtype='object')

<div class="alert alert-block alert-danger">
<b>Problem 3) Write a Pandas program to add leading zeros to the integer column in a pandas series and makes the length of the field to 8 digit

In [11]:
nums = {'amount': [10, 250, 3000, 40000, 500000]}
df = pd.DataFrame(nums)

In [12]:
df.astype({'amount': 'str'})

   amount
0      10
1     250
2    3000
3   40000
4  500000

In [13]:
new_df = df.convert_dtypes(convert_string=True)

**Sample Solution 3)**

In [14]:
import pandas as pd
nums = {'amount': [10, 250, 3000, 40000, 500000]}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
print("\nAdd leading zeros:")
df['amount'] = df['amount'].apply(lambda x: '{0:0>8}'.format(x))
display(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000

Add leading zeros:

     amount
0  00000010
1  00000250
2  00003000
3  00040000
4  00500000

<div class="alert alert-block alert-info">
<b>Problem 4) Write a Pandas program to add leading zeros to the character column in a pandas series and makes the length of the field to 8 digit

In [15]:
import pandas as pd
nums = {'amount': ['10', '250', '3000', '40000', '500000']}
print("Original dataframe:")
df = pd.DataFrame(nums)
print(df)
print("\nAdd leading zeros:")
df['amount'] = list(map(lambda x: x.zfill(10), df['amount']))
display(df)

Original dataframe:
   amount
0      10
1     250
2    3000
3   40000
4  500000

Add leading zeros:

       amount
0  0000000010
1  0000000250
2  0000003000
3  0000040000
4  0000500000

In [17]:
df = pd.DataFrame(nums)
df['amount'] = df['amount'].apply(lambda x: '{0:0>10}'.format(x))
display(df)

       amount
0  0000000010
1  0000000250
2  0000003000
3  0000040000
4  0000500000

**Problem 5)** Write a Pandas program to capitalize all the string values of specified columns of a given DataFrame

In [27]:
dict1 = {'Colors' : ['red' , 'blue', 'yellow'],
        'Brightness' : [4,5,6]}
df = pd.DataFrame(dict1)

#this capitalizes the first character
df['Colors'] = df['Colors'].str.capitalize()

In [28]:
df

   Colors  Brightness
0     Red           4
1    Blue           5
2  Yellow           6

In [29]:
dict1 = {'Colors' : ['red' , 'blue', 'yellow'],
        'Brightness' : [4,5,6]}
df = pd.DataFrame(dict1)

df['Colors'] = df['Colors'].str.swapcase()
df

   Colors  Brightness
0     RED           4
1    BLUE           5
2  YELLOW           6

In [30]:
#sample solution alternative syntax
import pandas as pd
df = pd.DataFrame({
    'name': ['alberto','gino','ryan', 'Eesha', 'syed'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
print("\nAfter capitalizing name column:")
df['name'] = list(map(lambda x: x.capitalize(), df['name']))
display(df)

Original DataFrame:
      name date_of_birth    age
0  alberto     17/05/2002  18.5
1     gino     16/02/1999  21.2
2     ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     syed     15/09/1997  23.0

After capitalizing name column:

      name date_of_birth    age
0  Alberto     17/05/2002  18.5
1     Gino     16/02/1999  21.2
2     Ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     Syed     15/09/1997  23.0

**Problem 6)** Write a Pandas program to count of occurrence of a specified substring in a DataFrame column

In [3]:
dict1 = {'Colors' : ['red' , 'blue', 'yellow'],
        'Brightness' : [4,5,6],
        'Name' : ['Matthew', 'Terry', 'Kevin']}
df = pd.DataFrame(dict1)
df

   Colors  Brightness     Name
0     red           4  Matthew
1    blue           5    Terry
2  yellow           6    Kevin

In [5]:
df['Name'].str.count('at')

0    1
1    0
2    0
Name: Name, dtype: int64

In [6]:
df['Count'] = df['Name'].str.count('tt')
df

   Colors  Brightness     Name  Count
0     red           4  Matthew      1
1    blue           5    Terry      0
2  yellow           6    Kevin      0

In [7]:
#alternative solution
df.drop(columns='Count', inplace = True)
df['Count'] = list(map(lambda x: x.count('tt'), df['Name']))
df

   Colors  Brightness     Name  Count
0     red           4  Matthew      1
1    blue           5    Terry      0
2  yellow           6    Kevin      0

**Problem 7)**  Write a Pandas program to find the index of a given substring of a DataFrame column.

In [8]:
df.drop(columns='Count', inplace = True)

In [13]:
substring_index_list = list(df[df['Name'].str.contains('tt')].index)
substring_index_list

[0]

**Problem 8)** Write a Pandas program to find the index of a substring of DataFrame with beginning and end position

In [36]:
dict1 = {'Colors' : ['red' , 'blue', 'yellow'],
        'Brightness' : [4,5,6],
        'Name' : ['Matthew', 'Terry', 'Kevin']}
df = pd.DataFrame(dict1)
df

   Colors  Brightness     Name
0     red           4  Matthew
1    blue           5    Terry
2  yellow           6    Kevin

In [37]:
df['Index'] = list(map(lambda x: x.find('e', 0,4), df['Name']))

In [38]:
df

   Colors  Brightness     Name  Index
0     red           4  Matthew     -1
1    blue           5    Terry      1
2  yellow           6    Kevin      1

Thoughts: so when using str.find()  a -1 means that there was no occurence of the substring in the string

In [39]:
#will try this solution
df.drop(columns='Index', inplace = True)
df

   Colors  Brightness     Name
0     red           4  Matthew
1    blue           5    Terry
2  yellow           6    Kevin

In [40]:
df['Index'] = df['Name'].str.find('e',0,4)
df

   Colors  Brightness     Name  Index
0     red           4  Matthew     -1
1    blue           5    Terry      1
2  yellow           6    Kevin      1

In [41]:
#The above is also a solution

**Problem 9)** Write a Pandas program to check whether alpha numeric values present in a given column of a DataFrame

In [46]:
df['Name'].str.isalnum()

0    True
1    True
2    True
Name: Name, dtype: bool

In [48]:
#alterantive solution
list(map(lambda x: x.isalnum(), df['Name']))

[True, True, True]

**Problem 10)** Write a Pandas program to check whether alphabetic values present in a given column of a DataFrame.

In [56]:
df.drop(columns='Index', inplace = True)

In [57]:
list(map(lambda x: x.isalpha(), df['Name']))

[True, True, True]

In [58]:
#another solution
df['Name'].str.isalpha()

0    True
1    True
2    True
Name: Name, dtype: bool

**Problem 11)** Write a Pandas program to check whether only numeric values present in a given column of a DataFrame

In [62]:
list(map(lambda x: x.isnumeric(), df['Name']))

[False, False, False]

In [63]:
#alternative solution
df['Name'].str.isnumeric()

0    False
1    False
2    False
Name: Name, dtype: bool

**Problem 12)** Write a Pandas program to check whether only lower case or upper case is present in a given column of a DataFrame

In [64]:
#checking if only lowercase characters present
df['Name'].str.islower()

0    False
1    False
2    False
Name: Name, dtype: bool

In [65]:
list(map(lambda x: x.islower(), df['Name']))

[False, False, False]

In [66]:
#checking if only uppercase characters present
df['Name'].str.isupper()

0    False
1    False
2    False
Name: Name, dtype: bool

In [67]:
list(map(lambda x: x.isupper(), df['Name']))

[False, False, False]

**Problem 13)** Write a Pandas program to check whether only proper case or title case is present in a given column of a DataFrame.

In [68]:
df['Name'].str.istitle()

0    True
1    True
2    True
Name: Name, dtype: bool

In [69]:
#alternative solution
list(map(lambda x: x.istitle(), df['Name']))

[True, True, True]

**Problem 14)** Write a Pandas program to check whether only space is present in a given column of a DataFrame.

In [70]:
df['Name'].str.isspace()

0    False
1    False
2    False
Name: Name, dtype: bool

In [72]:
list(map(lambda x: x.isspace(), df['Name']))

[False, False, False]

**Problem 15)** Write a Pandas program to get the length of the string present of a given column in a DataFrame.

In [73]:
df['Name'].str.len()

0    7
1    5
2    5
Name: Name, dtype: int64

In [81]:
#alternative solution
list(map(lambda x: len(x), df['Name']))

[7, 5, 5]

Interestinglyt enough, for the top, this solution only works when you use len(x), it will not work if you use x.len() .  I do not understand why

In [82]:
#alternative solution
df['Name'].apply(len)

0    7
1    5
2    5
Name: Name, dtype: int64

<div class="alert alert-block alert-info">
<b>Problem 16) Write a Pandas program to get the length of the integer of a given column in a DataFrame.

In [86]:
df['Brightness'] = [14,260,4596]

In [ ]:
df

In [92]:
list(map(lambda x: len(str(x)), df['Brightness']))

[2, 3, 4]

In [95]:
#alternative solution
df['Brightness'].apply(str).apply(len)

0    2
1    3
2    4
Name: Brightness, dtype: int64

In [101]:
#in the sample solution format
df['Brightness'].map(str).apply(len)

0    2
1    3
2    4
Name: Brightness, dtype: int64

**LOOK** can refer to this article for differences between map(), apply(), and applymap(): https://towardsdatascience.com/introduction-to-pandas-apply-applymap-and-map-5d3e044e93ff#:~:text=apply()%20is%20used%20to,a%20Series%20with%20another%20value.

**Problem 17)** Write a Pandas program to check if a specified column starts with a specified string in a DataFrame

In [104]:
df['Name'].str.startswith('M')

0     True
1    False
2    False
Name: Name, dtype: bool

In [105]:
#alternative solution
pd.Series(map(lambda x: x.startswith('M'), df['Name']))

0     True
1    False
2    False
dtype: bool

**Problem 18)** Write a Pandas program to swap the cases of a specified character column in a given DataFrame

In [110]:
df['Name'].str.swapcase()

0    mATTHEW
1      tERRY
2      kEVIN
Name: Name, dtype: object

In [112]:
#alterative solution
pd.Series(map(lambda x: x.swapcase(), df['Name']))

0    mATTHEW
1      tERRY
2      kEVIN
dtype: object

**Problem 19)** Write a Pandas program to convert a specified character column in upper/lower cases in a given DataFrame

In [113]:
df

   Colors  Brightness     Name
0     red          14  Matthew
1    blue         260    Terry
2  yellow        4596    Kevin

In [114]:
df['Name'].str.upper()

0    MATTHEW
1      TERRY
2      KEVIN
Name: Name, dtype: object

In [118]:
#alternative solution
pd.Series(map(lambda x: x.upper(), df['Name']))

0    MATTHEW
1      TERRY
2      KEVIN
dtype: object

**Problem 20)** Write a Pandas program to convert a specified character column in title case in a given DataFrame

In [119]:
df['Name'].str.title()

0    Matthew
1      Terry
2      Kevin
Name: Name, dtype: object

In [120]:
#alternative solution
pd.Series(map(lambda x: x.title(), df['Name']))

0    Matthew
1      Terry
2      Kevin
dtype: object

**Problem 21)** Write a Pandas program to replace arbitrary values with other values in a given DataFrame

In [121]:
df['Name'].str.replace('Matthew', 'Ben')

0      Ben
1    Terry
2    Kevin
Name: Name, dtype: object

In [122]:
#alternative solution
pd.Series(map(lambda x: x.replace('Matthew', 'Ben'), df['Name']))

0      Ben
1    Terry
2    Kevin
dtype: object

In [124]:
df['Name'].apply(lambda x: x.replace('Matthew', 'Ben'))

0      Ben
1    Terry
2    Kevin
Name: Name, dtype: object

**Problem 22)** Write a Pandas program to replace more than one value with other values in a given DataFrame

In [127]:
#this does not work
df['Name'].str.replace(["Matthew", "Terry"], ["Kevin", "Kevin"])

TypeError: repl must be a string or callable

In [128]:
#this works
df['Name'].replace(['Matthew', 'Terry'], ['Kevin', 'Kevin'])

0    Kevin
1    Kevin
2    Kevin
Name: Name, dtype: object

<div class="alert alert-block alert-danger">
<b>Problem 23) Write a Pandas program to split a string of a column of a given DataFrame into multiple columns

In [129]:
df

   Colors  Brightness     Name
0     red          14  Matthew
1    blue         260    Terry
2  yellow        4596    Kevin

**Sample Solution 23)**

In [132]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto  Franco','Gino Ann Mcneill','Ryan  Parkes', 'Eesha Artur Hinton', 'Syed  Wharton'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df[["first", "middle", "last"]] = df["name"].str.split(" ", expand = True)
print("\nNew DataFrame:")
display(df)

Original DataFrame:
                 name date_of_birth    age
0     Alberto  Franco     17/05/2002  18.5
1    Gino Ann Mcneill     16/02/1999  21.2
2        Ryan  Parkes     25/09/1998  22.5
3  Eesha Artur Hinton     11/05/2002  22.0
4       Syed  Wharton     15/09/1997  23.0

New DataFrame:

                 name date_of_birth    age    first middle     last
0     Alberto  Franco     17/05/2002  18.5  Alberto          Franco
1    Gino Ann Mcneill     16/02/1999  21.2     Gino    Ann  Mcneill
2        Ryan  Parkes     25/09/1998  22.5     Ryan          Parkes
3  Eesha Artur Hinton     11/05/2002  22.0    Eesha  Artur   Hinton
4       Syed  Wharton     15/09/1997  23.0     Syed         Wharton

<div class="alert alert-block alert-info">
<b>Problem 24) Write a Pandas program to extract email from a specified column of string type of a given DataFrame

In [133]:
df = pd.DataFrame({
    'name_email': ['Alberto Franco af@gmail.com','Gino Mcneill gm@yahoo.com','Ryan Parkes rp@abc.io', 'Eesha Hinton', 'Gino Mcneill gm@github.com']
    })

In [134]:
df

                    name_email
0  Alberto Franco af@gmail.com
1    Gino Mcneill gm@yahoo.com
2        Ryan Parkes rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com

In [143]:
df['Email'] = df['name_email'].str.split(" ", expand = True).loc[:,2]

In [146]:
test = df['name_email'].str.split(" ", expand = True)
#so split will split the strings in the df column and expand will put that output into a df

In [151]:
#so now I want to combine the strings in columns 0,1 into a new column
test

         0        1              2
0  Alberto   Franco   af@gmail.com
1     Gino  Mcneill   gm@yahoo.com
2     Ryan   Parkes      rp@abc.io
3    Eesha   Hinton           None
4     Gino  Mcneill  gm@github.com

In [154]:
test[3] = test[0] + ' ' + test[1]

In [156]:
test

         0        1              2               3
0  Alberto   Franco   af@gmail.com  Alberto Franco
1     Gino  Mcneill   gm@yahoo.com    Gino Mcneill
2     Ryan   Parkes      rp@abc.io     Ryan Parkes
3    Eesha   Hinton           None    Eesha Hinton
4     Gino  Mcneill  gm@github.com    Gino Mcneill

**Sample Solution 24)**

In [157]:
import pandas as pd
import re as re
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'name_email': ['Alberto Franco af@gmail.com','Gino Mcneill gm@yahoo.com','Ryan Parkes rp@abc.io', 'Eesha Hinton', 'Gino Mcneill gm@github.com']
    })
print("Original DataFrame:")
print(df)
def find_email(text):
    email = re.findall(r'[\w\.-]+@[\w\.-]+',str(text))
    return ",".join(email)
df['email']=df['name_email'].apply(lambda x: find_email(x))
print("\Extracting email from dataframe columns:")
display(df)

Original DataFrame:
                    name_email
0  Alberto Franco af@gmail.com
1    Gino Mcneill gm@yahoo.com
2        Ryan Parkes rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com
\Extracting email from dataframe columns:

                    name_email          email
0  Alberto Franco af@gmail.com   af@gmail.com
1    Gino Mcneill gm@yahoo.com   gm@yahoo.com
2        Ryan Parkes rp@abc.io      rp@abc.io
3                 Eesha Hinton
4   Gino Mcneill gm@github.com  gm@github.com

<div class="alert alert-block alert-danger">
<b>Problem 25) Write a Pandas program to extract hash attached word from twitter text from the specified column of a given DataFrame.

In [158]:
import pandas as pd
import re as re
pd.set_option('display.max_columns', 10)
df = pd.DataFrame({
    'tweets': ['#Obama says goodbye','Retweets for #cash','A political endorsement in #Indonesia', '1 dog = many #retweets', 'Just a simple #egg']
    })
print("Original DataFrame:")
print(df)
def find_hash(text):
    hword=re.findall(r'(?<=#)\w+',text)
    return " ".join(hword)
df['hash_word']=df['tweets'].apply(lambda x: find_hash(x))
print("\Extracting#@word from dataframe columns:")
display(df)

Original DataFrame:
                                  tweets
0                    #Obama says goodbye
1                     Retweets for #cash
2  A political endorsement in #Indonesia
3                 1 dog = many #retweets
4                     Just a simple #egg
\Extracting#@word from dataframe columns:

                                  tweets  hash_word
0                    #Obama says goodbye      Obama
1                     Retweets for #cash       cash
2  A political endorsement in #Indonesia  Indonesia
3                 1 dog = many #retweets   retweets
4                     Just a simple #egg        egg

**Regex Reference** https://docs.python.org/3/howto/regex.html#regex-howto

the \w+   indicates that there has to be atleast 1 occurence of an alphanumeric